[{"id":17641,"name":"Dr. Mario","platforms":"Game Boy, Game Boy Advance, Super Nintendo Entertainment System, Nintendo Entertainment System, Satellaview, Nintendo 3DS eShop, Wii U","summary":"A puzzle game that released in the midst of the Tetris craze, Dr. Mario put its own spin on the falling-blocks concept. It was one of the few Tetris derivatives of the time that was a hit in its own right.","description":"<h2>Overview</h2><p>Dr. Mario is a puzzle game developed by <a href=\"/nintendo-rd1/3010-928/\" data-ref-id=\"3010-928\">Nintendo R&amp;D1</a> and published by <a href=\"/nintendo/3010-90/\" data-ref-id=\"3010-90\">Nintendo</a>. The game was originally released on the Nintendo Entertainment System and Game Boy in 1990. It has since seen many sequels and remakes, such as <a href=\"/dr-mario-puzzle-league/3030-14788/\" data-ref-id=\"3030-14788\">Dr. Mario &amp; Puzzle League</a> on the Game Boy Advance and <a href=\"/dr-mario-online-rx/3030-20691/\" data-ref-id=\"3030-20691\">Dr. Mario Online RX</a> on WiiWare. The soundtrack was composed by <a href=\"/hirokazu-tanaka/3040-51028/\" data-ref-id=\"3040-51028\">Hirokazu \"Hip\" Tanaka</a>.</p><p>According to the instruction booklet, Mario is now working as a doctor in the virus research lab at the Mushroom Kingdom Hospital. As usual, Dr. Mario is about to begin his research when Nurse Toadstool informs him that several viruses are out of control and spreading quickly. Mario exclaims <i>\"Oh No! We've got to do something! I have just developed a new vitamin that should be able to take care of it. I sure hope this stuff works!\"</i></p><h2>Gameplay</h2><figure data-align=\"right\" data-size=\"small\" data-ref-id=\"1300-364238\" data-img-src=\"http://static.giantbomb.com/uploads/original/1/13084/364238-dr_mario_2008_07_29_00_37_36_78.png\" data-embed-type=\"image\" data-ratio=\"0.75\"><a class=\"fluid-height\" style=\"padding-bottom:75.0%\" href=\"http://static.giantbomb.com/uploads/original/1/13084/364238-dr_mario_2008_07_29_00_37_36_78.png\" data-ref-id=\"1300-364238\"><img alt=\"Gameplay in Dr. Mario\" src=\"http://static.giantbomb.com/uploads/scale_small/1/13084/364238-dr_mario_2008_07_29_00_37_36_78.png\" srcset=\"http://static.giantbomb.com/uploads/original/1/13084/364238-dr_mario_2008_07_29_00_37_36_78.png 1024w, http://static.giantbomb.com/uploads/scale_super/1/13084/364238-dr_mario_2008_07_29_00_37_36_78.png 960w, http://static.giantbomb.com/uploads/scale_medium/1/13084/364238-dr_mario_2008_07_29_00_37_36_78.png 480w, http://static.giantbomb.com/uploads/scale_small/1/13084/364238-dr_mario_2008_07_29_00_37_36_78.png 320w\" sizes=\"(max-width: 320px) 100vw, 320px\" data-width=\"320\"></a><figcaption>Gameplay in Dr. Mario</figcaption></figure><p>Dr. Mario is a puzzle game that uses much the same <a href=\"//www.giantbomb.com/falling-blocks/3015-4539/\" data-ref-id=\"3015-4539\">falling block</a> mechanic made ubiquitous by <a href=\"/tetris/3030-1896/\" data-ref-id=\"3030-1896\">Tetris</a>. Vitamin capsules are dropped into the play field and must be rotated to remove viruses hovering at fixed spots (each half the size of a vitamin.) The vitamins are colored one of three colors on each side (red, yellow, or blue,) and the colors of the vitamin must be matched with the corresponding viruses of the same colors. After stacking up four of the same color, the virus is eliminated. After destroying all viruses on the playing field, the player progresses to the next level.</p><p>The player can select 21 different levels (0 to 20), and players who can clear level 20 can make it all the way to level 24 (clearing 24 just repeats this level continuously). Each level has a different amount of viruses, and in level 20 there are 84. No more than 84 can fit, making each level after 20 have 84 viruses as well. The player can also select the background music, either Fever or Chill. The game speed can also be set to low, medium, or high.  The more time spent clearing a particular level, the faster the game speed will gradually become. </p>","rating":[{"api_detail_url":"http://www.giantbomb.com/api/game_rating/3065-6/","id":6,"name":"ESRB: E"},{"api_detail_url":"http://www.giantbomb.com/api/game_rating/3065-19/","id":19,"name":"CERO: All Ages"},{"api_detail_url":"http://www.giantbomb.com/api/game_rating/3065-7/","id":7,"name":"PEGI: 3+"}],"image":"http://www.giantbomb.com/api/image/square_avatar/2269410-box_drmario.png"}]